examples/dfLowMachFoam/oneD_freelyPropagation/CH4/torchSolver/constant/CanteraTorchProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


chemistry           on;
CanteraMechanismFile "drm19.yaml";
transportModel "Mix";
odeCoeffs
{
    "relTol"   1e-6;
    "absTol"   1e-10;
}
inertSpecie        "N2";
zeroDReactor
{
    //cvorcp "UV";
}
torch on;
torchModel "new_modle.pt";  

torchParameters  
{
    Xmu
    (
        2217.681756356299
        1.2372712155690098
        -6.609314703664828
        -7.199323262359706
        -7.332119442940071
        -5.536742631230836
        -7.141802501972486
        -6.333364316313202
        -8.281175325793479
        -8.060951482192744
        -8.49172604048069
        -7.4362163282010165
        -7.260022789860538
        -5.901163772303269
        -7.06737218812143
        -8.399800896426937
        -7.837104938350125
        -9.101106174651347
        -6.740307445673868
        -8.599370078438403
        -8.527557104158248
        -0.7933260588414361
        -10.0
    );

    Xstd
    (
       431.02496274992524
        0.43376378804689036
        2.250444184227253
        1.5647416107504606
        2.0410742923466034
        2.75788270699218
        1.7690213388390568
        2.6060105142365306
        1.2877128635203885
        1.5196568528155139
        1.187695396994965
        1.8513826185906734
        2.3900253720056415
        2.5641309214772487
        2.2930767685500215
        1.0796313028856495
        1.5875358125877437
        0.7985642336685125
        2.8916261288345817
        1.2874033801112403
        1.5502545098064442
        1.172788655352323
        0.0
    );

    Ymu
    (
         8611599.996488582
        1.0052402090809686e-13
        306261.2582791327
        302952.5661750507
        246191.97294072132
        55748.11516946665
        282740.30622731353
        338184.77009267046
        154989.97473252448
        161933.173349431
        116333.18977890848
        223721.37434340312
        121632.89085603201
        385655.7343662997
        236970.81031441092
        120921.61016921779
        196030.99284250094
        10072.793690942817
        217110.811370787
        66131.62556631157
        62348.07619523203
        1.541860153892557e-08
        0.0
    );

    Ystd
    (
        43905478.14125182
        2.1250436459521883e-10
        931519.7384718517
        910510.3349682757
        974754.1196238518
        521783.8276859063
        1007243.1555762171
        1080286.1639236603
        750969.551828101
        813498.3823317331
        699083.7766516082
        935639.3875055335
        700980.8395528512
        1128324.3659794962
        787883.0462028814
        802501.6759949023
        866138.6664999034
        570611.085616025
        911540.1747972643
        735083.0620995432
        691625.7072341049
        3.357557946945996e-05
        0.0
    );
}
loadbalancing
{
        active  false;
        //log   true;
}
// ************************************************************************* //
