examples/dfLowMachFoam/oneD_freelyPropagation/CH4/torchSolver/0/O2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "1";
    object       O2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar>
4335
(
2.200604516335296e-01
2.200604516405984e-01
2.200604516476183e-01
2.200604516545895e-01
2.200604516615120e-01
2.200604516683859e-01
2.200604516752115e-01
2.200604516819887e-01
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.22006045;
    }
    outlet
    {
        type            zeroGradient;
    }
    wall
    {
        type            empty;
    }
}


// ************************************************************************* //
